# Dispose Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSizeIterator..::..Dispose Method
DuctSizeIterator Class See Also
---
Releases all resources used by the DuctSizeIterator
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# See Also
DuctSizeIterator Class
Autodesk.Revit.DB.Mechanical Namespace